OpenFOAM/QGDFoam-OFv2012/cases/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     QGDFoam;

startFrom       startTime; //latestTime; 

startTime       0;

stopAt          endTime;

endTime         5.0; 

deltaT          1e-11; 

writeControl    adjustableRunTime;

writeInterval   0.1; 

purgeWrite      0;

writeFormat     ascii; //binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo 0.2; 

maxDeltaT 0.2;

//functions
//{
//    #include "fieldAverage1"
//}

libs ("libcompressibleTools.so" "liblocalThermoLib.so");

// ************************************************************************* //
