OpenFOAM/QGDFoam-OFv2012/cases/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    
     (0 0 0.04)    //0
     (1 0 0.04)    //1
     (1 0 -0.04)   //2
     (0 0 -0.04)   //3
     (0 1 0.04)    //4
     (1 1 0.04)    //5
     (1 1 -0.04)   //6
     (0 1 -0.04)   //7
     (0 2 0.04)    //8
     (2.5 2 0.04)  //9
     (2.5 2 -0.04) //10
     (0 2 -0.04)   //11
     (2.5 1 0.04)  //12
     (2.5 1 -0.04) //13
     (1 2 0.04)    //14
     (1 2 -0.04)   //15

);

blocks
(
    hex (3 2 6 7 0 1 5 4) (50 50 1) simpleGrading (1 1 1)
    hex (7 6 15 11 4 5 14 8) (50 50 1) simpleGrading (1 1 1)
    hex (6 13 10 15 5 12 9 14) (76 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 9 12 13)
        );
    }
    walls
    {
        type wall;
        faces
        (   
            (3 7 4 0)
            (7 11 8 4)
            (6 5 1 2)
            (6 13 12 5)
            (11 15 14 8)
            (15 10 9 14)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (4 5 14 8)
            (5 12 9 14)
            (3 2 6 7)
            (7 6 15 11)
            (6 13 10 15)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //