OpenFOAM/QGDFoam-OFv2012/cases/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       17374;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       17424;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          352;
        startFace       17474;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17600;
        startFace       17826;
    }
)

// ************************************************************************* //
