OpenFOAM/QGDFoam-OFv2012/cases/0/p

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  0.7142; 

boundaryField
{
    "(inlet).*"
    {

        type           uniformFixedValue; 
        uniformValue   uniform 0.7142; 
        value          uniform  0.7142; 
    }
    
    "(outlet).*"
    {
           
        type            zeroGradient;

}
    
    ".*(walls).*"
    {
        type            zeroGradient;
    }
    
    #include "constr.include"
}

// ************************************************************************* //


