OpenFOAM/QGDFoam-OFv2012/cases/0/ScQGD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ScQGD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    "(inlet).*"
    {
        type            calculated;
        value           $internalField;
    }
    
    "(outlet).*"
    {
        type            calculated;
        value           $internalField;
    }
    
    ".*(walls).*"
    {
        type            fixedValue;
        value           0.0; 
    }
    
}


// ************************************************************************* //
