OpenFOAM/QGDFoam-OFv2012/cases/0/constr.include
    wedge1
    {
	type		wedge;
    }

    wedge2
    {
	type		wedge;
    }

    axes
    {
	type		slip;
    }
    