OpenFOAM/QGDFoam-OFv2012/cases/system/fieldAverage1
    fieldAverage1
    {
        // Type of functionObject
        type            fieldAverage;

        // Where to load it from (if not already in solver)
        libs ("libfieldFunctionObjects.so");

        // Function object enabled flag
        enabled         true;

        // When to output the average fields
        writeControl   writeTime;

        // Fields to be averaged - runTime modifiable
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
                windowType  exact;
                allowRestart true;
                window      2e-3; // optional averaging window
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
                windowType  exact;
                allowRestart true;
                window      2e-3; // optional averaging window
            }
            
            T
            {
                mean        on;
                prime2Mean  off;
                base        time;
                windowType  exact;
                allowRestart true;
                window      2e-3;
            }
        );
    }

